
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 10 to change, 3 to destroy.</code></pre>

* Create
  * module.redis.azurerm_private_endpoint.this[0]
  * module.redis.azurerm_redis_cache.redis
  * module.redis.azurerm_resource_group.cache-resourcegroup[0]
* Update
  * azurerm_key_vault_secret.redis_connection_string
  * module.div-aos-overdue-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-bulk-print-config-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-bulkcase-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-data-extraction-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-fe-performance-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-server-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.divorce-action-group.azurerm_resource_group_template_deployment.action-group
  * module.divorce-action-group2.azurerm_resource_group_template_deployment.action-group
* Delete
  * module.redis-cache.azurerm_private_endpoint.this[0]
  * module.redis-cache.azurerm_redis_cache.redis
  * module.redis-cache.azurerm_resource_group.cache-resourcegroup[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_connection_string" {
      - content_type            = "" -> null
        id                      = "https://div-aat.vault.azure.net/secrets/redis-connection-string/0698b958069b4b4ebf0ea1ef70a32954"
        name                    = "redis-connection-string"
        tags                    = {}
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.div-aos-overdue-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-aos-overdue-alert"
        name                = "div-aos-overdue-alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.div-bulk-print-config-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-bulk-print-config-errors-alert"
        name                = "div-bulk-print-config-errors-alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.div-bulkcase-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-bulkcase-errors"
        name                = "div-bulkcase-errors"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.div-data-extraction-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-data-extraction-alert"
        name                = "div-data-extraction-alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.div-fe-performance-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-fe-performance-alert"
        name                = "div-fe-performance-alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.div-server-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-server-errors"
        name                = "div-server-errors"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.div-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat|div-aat"
        name                       = "div-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.divorce-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-support"
        name                     = "div-support"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.divorce-action-group2.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-support2"
        name                     = "div-support2"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.redis.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "div-aat"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "div-cache-aat"
      + subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          + "application"         = "divorce"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#div-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Divorce"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "div-aat"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "div-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "div-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          + "application"         = "divorce"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#div-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Divorce"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.redis.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "div-cache-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          + "application"         = "divorce"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#div-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Divorce"
        }
    }

  # module.redis-cache.azurerm_private_endpoint.this[0] will be destroyed
  # (because azurerm_private_endpoint.this is not in configuration)
  - resource "azurerm_private_endpoint" "this" {
      - custom_dns_configs       = [] -> null
      - id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cache-aat/providers/Microsoft.Network/privateEndpoints/div-aat" -> null
      - location                 = "uksouth" -> null
      - name                     = "div-aat" -> null
      - network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cache-aat/providers/Microsoft.Network/networkInterfaces/div-aat.nic.d00bde49-803a-4f8f-a14c-2515a8f50ae1"
              - name = "div-aat.nic.d00bde49-803a-4f8f-a14c-2515a8f50ae1"
            },
        ] -> null
      - private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cache-aat/providers/Microsoft.Network/privateEndpoints/div-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "div-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.14",
                        ]
                      - name         = "div-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name      = "div-cache-aat" -> null
      - subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat" -> null
      - tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          - "application"         = "divorce"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#div-dev"
          - "environment"         = "staging"
          - "managedBy"           = "Divorce"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cache-aat/providers/Microsoft.Network/privateEndpoints/div-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> null
          - name                 = "redis-endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection           = false -> null
          - name                           = "div-aat" -> null
          - private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cache-aat/providers/Microsoft.Cache/redis/div-aat" -> null
          - private_ip_address             = "10.96.136.14" -> null
          - subresource_names              = [
              - "redisCache",
            ] -> null
        }
    }

  # module.redis-cache.azurerm_redis_cache.redis will be destroyed
  # (because azurerm_redis_cache.redis is not in configuration)
  - resource "azurerm_redis_cache" "redis" {
      - capacity                      = 1 -> null
      - enable_non_ssl_port           = false -> null
      - family                        = "P" -> null
      - hostname                      = "div-aat.redis.cache.windows.net" -> null
      - id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cache-aat/providers/Microsoft.Cache/redis/div-aat" -> null
      - location                      = "uksouth" -> null
      - minimum_tls_version           = "1.2" -> null
      - name                          = "div-aat" -> null
      - port                          = 6379 -> null
      - primary_access_key            = (sensitive value)
      - primary_connection_string     = (sensitive value)
      - public_network_access_enabled = false -> null
      - redis_version                 = "6.0" -> null
      - replicas_per_master           = 0 -> null
      - replicas_per_primary          = 0 -> null
      - resource_group_name           = "div-cache-aat" -> null
      - secondary_access_key          = (sensitive value)
      - secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      - sku_name                      = "Premium" -> null
      - ssl_port                      = 6380 -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          - "application"         = "divorce"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#div-dev"
          - "environment"         = "staging"
          - "managedBy"           = "Divorce"
        } -> null
      - tenant_settings               = {} -> null
      - zones                         = [] -> null

      - redis_configuration {
          - aof_backup_enabled              = false -> null
          - enable_authentication           = true -> null
          - maxclients                      = 7500 -> null
          - maxfragmentationmemory_reserved = 642 -> null
          - maxmemory_delta                 = 642 -> null
          - maxmemory_policy                = "volatile-lru" -> null
          - maxmemory_reserved              = 642 -> null
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
        }
    }

  # module.redis-cache.azurerm_resource_group.cache-resourcegroup[0] will be destroyed
  # (because azurerm_resource_group.cache-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "cache-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cache-aat" -> null
      - location = "uksouth" -> null
      - name     = "div-cache-aat" -> null
      - tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          - "application"         = "divorce"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#div-dev"
          - "environment"         = "staging"
          - "managedBy"           = "Divorce"
        } -> null
    }

Plan: 3 to add, 10 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":85,"Program":"tfcmt","SHA1":"","Vars":{}} -->